["Avoid this place like its on fire.\nRun down, bad AC, joke bathrooms, a dump.\nIt used to be an OK place, now it needs to be demolished.\nIt is a great location, but for free it is over priced.\nNo amenities, roof top always closed for private events, staff was the worst.\nLiterally the toilets are 3 inched from the walls.\nAVOID AT ALL COSTS.\nSo many better alternatives within 2 blocks.\n", "Great location. It is only a 5 minute walk to Central Park, and 2 minutes to the nearest subway station. There’s a good restaurant at the bottom of the hotel as well. Staff was friendly. Only real gripe was there were no ice machines, or small fridges in the rooms. We’d stay again for sure. ", "This is our second time staying at the Empire. We really do like this hotel. Love that we are so close to Times Square, Rockefeller Center and Broadway, but most of all Central Park! Our mornings and evenings always start with Starbucks (in same building) and a walk/rock climb in the park. \nThe only complaint we had this time was the temperature in the room.. even though it was spring.. the room was so warm to the point we all had issues sleeping. We opened the window, but it was much too loud to keep open overnight. Beds were also pretty hard, which I didnt remember from our last stay. ", "Loved the location next to Lincoln Center and Columbus Circle", "Terrific hotel. Everyone bends over backwards to be of service.", "Location was perfect and staff was friendly.  It was quiet. The bathroom could use some painting / patching.  Bed was comfortable! View of Lincoln Center was exciting. Clean hotel.", "Good location but old hotel", "Was in a great area, would definitely stay here again. :)", "Empire Hotel was an exceptional stay with kind and supportive staff, clean rooms with charming historical character. We greatly appreciated our stay and would recommend this hotel to anyone interested in visiting New York! ", "My only request would have been to have had a coffee machine in the room. ", "The staff was amazing everyone was very friendly. The hotel was beautiful but our room had a moldy smell. Location was great very safe and family friendly. ", "Pros- location- Lincoln center and Columbus circle- easy access to Central Park and a short walk to broadway. \nShower head was great\nBed was very comfortable\n\nCons- very dated room with rust in the bathroom, and an old ac system that didn’t work for most of the stay\nNo clock on the night table\nNo coffee maker and no coffee available in the hotel\n\n*** I was refunded one nights stay because of the ac unit, a leaky faucet, and the refrigerator not cold. ", "Great property in a great location for those spending time in the Upper Westside. ", "This is a perfect hotel to be in Manhattan, close to many attractions, restaurants, shopping. The room are comfortable enough to be a few days. ", "Nice hotel. Convenient to everything.", "Good location, staff friendly and helpful, historic property", "- Gym closed \n- Unfriendly staff at reception\n- no hot water in the shower\n- a/c made a terrible sound all night", "This property was very nice", "I loved the location right next to Lincoln Center, a short walk from Central Park and public transportation. The room was lovely- comfortable, clean.  I will be staying there every time I travel to NYC!", "Nice hotel. Great location ", "We were impressed about how the doorman always welcomed us and the excellent staff.   The maids were tip top.   Plan to come again when our son sings at the Met.  Our daughter opened on Broadway with Paradise Square. We usually stay closer to theater district but enjoyed this more.  Thanks ", "Quaint rooms with excellent decor, reminded us over a European hotel.", "The bathrooms are Very small and no room for anything but your body. No coffee in room", "The location is the best!", "The Wifi did not work consistently during our entire 5 day stay. There were constant connection disruptions. There was no hot water for at least 16 hours. The room we had was tiny, on the first floor, and had a ugly view of mechanical equipment.", "Broken AC, dirty carpet, peeling paint on doors, no remote for the television. Very hard mattresses.  Roaches in bathroom. Maintenance came to room three times and couldn’t repair AC. Spent the first night burning up. Moved to another room that had no remote. It took them a day to bring us a remote. We were told by front desk that we would be reimbursed $100 for our inconvenience. However, when we checked out the front desk had no record of this reimbursement so it did not happen. The carpet was dirty and there are roaches. Great location but that’s about it. Wouldn’t recommend this hotel and won’t stay here again. ", "Ease of location to my destination. Clean and comfy.", "Friendly. Superconvenient for our visit!  We loved it.", "The Empire hotel has walls of paper. Street noise I could take, but the talk and laughter from the adjacent room was like I was in my bed amongst them - and at 3:30 am!\nAlso, had to search for a sign outside the hotel that the hotel was the hotel. Directions about the tv use and check-in and check-out times were non-existent. Fix these things and the hotel would be a great place to stay because of location. Right now I'd never return.", "The hotel rooms are very small. The hotel also added $500 in erroneous charges to my account post-check-out. I found some front desk workers rude. I’ve called 5 times to get charges removed and keep getting transferred to lines that do not exist.", "Property was really nice staff was super friendly the only thing is every single amenity was not working or closed", "I want to thank the staff at the empire hotel! You guys truly made my birthday weekend, between letting us check in early as our flight got in at 11am and their friendly hospitality. I would definitely stay again. This location is close enough to catch the 1 train all through Manhattan and just a walking distance from Central Park. The rooms are a little small but it’s New York, you kind of expect that already. ", "All things very good and fantastic neighborhood. Only the room a  bit small. Next visit will try to get junior suite. Recommend it", "Friendly and knowledgeable staff!!! Great location - close to everything that needs to be seen, visited, shopped!!! Dinning!!! Thank you!!!", "The staff were really nice and the location is close to every place we wanted to visit", "Easy access to Central Park and Lincoln Center", "The first room was in the back overlooking the ac units. I then went to the front desk and asked for a room with a view. I was put on the first floor and had to call maintainence for the toliet issue as it would not stop running. ", "Rather unclean. No hand towels or face cloths the first day (didn’t think to ask so I guess that’s on us? 🤔). No ice machine.  Mattress not very comfortable.  Didn’t even stay the second night.  ", "Excellent, helpful staff and great location across the street from Lincoln Center and within walking distance of Times Square and the Metropolitan Museum. Oddly, no coffee pots in rooms and no room service. Fortunately, there was a Starbucks right around the corner.", "Great location and staff were very.pleasant.  I would there again.  The big downside.is no.coffee the.rooms. I have.traveled in.5.continents and never not had coffee in room. They need to be tranparent and have.it in their description ", "Air conditioner/heater broke the first night. Repairman in room at 10pm working on it. Thought he fixed it but the room ended up being 78 all night. Next day, Pasqual moved us to a new room. Unfortunately, we had to come back to the hotel from 3-5pm time period to make the switch. He was awesome. Gave us a room with a great view; however, the sink backed up and wouldn’t drain in the new room. Feel like this hotel needs some major repair work done. Main lights on iconic roof sign had letters out. ", "The overall aesthetic of this place is great. The staff was extremely friendly and the room was well maintained.\n\nMy only gripe...the proximity of the toilet to the sink. It was literally put up against it. Requires you to sit awkwardly at an angle on the toilet and lean over.\n\nOther than that, it was centrally located to everything we needed.", "I was in NY for the MetOpera and it was directly across the street... also very close metro and good restaurants close by.  The room was comfortable and clean.. would definitely recommend.", "Everything was amazing! I highly recommend!", "My mother and I very much enjoyed our stay at The Empire. This was my 5th trip to NYC and I will stay here again. The location was outstanding as I love the Upper West Side and you can walk to restaurants, coffee shops, Lincoln Center, and Central Park. The staff was especially friendly, especially Dennis, who was so kind and helpful with my mother who uses a walker. ", "I loved the welcome I received at front desk. Hospitality was top notch. The room was clean and neat.  The location of the hotel is absolutely great. Close to great restaurants to grab dinner or breakfast. However, I didn’t like that the tv was not updated. Couldn’t login to watch Netflix or anything. I wish the bathroom had a blow dryer. ", "This is the best place to stay if you are going to Lincoln center!  ", "I have been to NYC several times.  This location and hotel have been my favorite so far and I would definitely stay there again. ", "We had an 8 o'clock at Lincoln Center, which is right across the street! 5 restaurants also right across the street. Easy check-in and check-out! PERFECT!", "Great place and friendly staff ", "Everything as advertised ", "I enjoyed my stay here. I was solo traveling and felt safe. The check in was smooth and the loby is beautiful! My room was cleaned daily and the bellhops were super nice. Def coming back. ", "Property is clean and in a great location. Rooftop bar is very cool", "Excellent! Loved the hotel and the area. We booked a superior room and were lucky enough to be treated to magnificent views of the Lincoln Center, Broadway and other streets. Hope to stay here again!", "Heating was too high and we have no control of it at the room…almost like a “sauna”", "Loved walking across the street to Lincoln Center and several good dining options nearby. It’s also very convenient to Central Park. The staff was friendly and helpful but the facility needs attention. Ice was difficult to obtain and glasses nonexistent-only paper cups available. There were no drawers to put away belongings and the bed was so-so. ", "The hotel is perfect for attending the opera at the MET.  Staying more than one night in a tiny room isn't recommended.", "Refurbished hotel was beautiful. Air cooling system could circulate the air better. \nAnd - a grab bar is needed in the shower as well as a shelf to put one’s toiletries on. ", "Location, location, location!  You are virtually steps away from Lincoln Center and a few more to Juliard. Then it’s a hop skip and jump to Central Park and Columbus Circle.\nThe lobby and door staff were exceptionally friendly and helpful. And special kudos to the cleaning staff. They didn’t miss a beat and kept our room and the hallways immaculately clean.\nThe wi-fi really sucks! Can’t believe they are allowed to claim it as an amenity.\nThe rooftop lounge allows you to overlook the wi-fi.", "Easy walk to surrounding attractions", "Great location, super friendly and accommodating staff, clean", "Lovely room but no refrigerator that worked, no microwave or coffee maker. Those are amenities I’ve had at cheap chain motels", "centrally located, near central park. \n\nnot well maintained, no room service. tiny and not cleaned bathrooms in the room. ", "Perfect location, lovely staff made for an enjoyable stay.", "Pleasantly surprised and happy with my stay.", "Location can’t be beat!!  Room was beautiful!  Staff was warm friendly and so helpful!", "I felt the room was very small for a superior king room. The bathroom even smaller. Only one person at a time could fit in the bathroom. Also, very tight for just one person in the bathroom. ", "Great location, roof top bar, dependable- many stays", "Rooftop bar is nice.\nGym was closed with no notice.\nStaff was inattentive to detail. Did not receive package left for me at checkin", "While the location is convenient to almost everything with subways and easy walking the Hotel is tired inside. They advertised fitness centre and pool were open but they weren’t. I asked for ice however not even a ice machine works. I was given lots of excuses but since my last stay here 4yrs this has definitely dropped in standards. ", "The card key sometimes didn’t work in the hotel room door.  I had to get the key changed a few times.", "Wonderful staff, fantastic location for Lincoln center, great roof top bar.\n\n\n\n\n", "Close to the Ballet, Lincoln film theater and Metropolitan opera house and other venues at Lincoln center! Very Safe to go to Theater at night and return back to the hotel!The ambience of the hotel decor is phenomenal . The Staff are welcoming and will take care of you especially if you are traveling alone!", "It was nice and quiet. The staff was helpful. I will stay there again.", "Great front desk person at check in!!", "Beautiful touches in decor, clean, great location, staff is delightful. ", "It was clean and quiet. ", "The rooms were small. The door would not open we had to yank on it several times before opening the door. Their were bugs. The room smelled like it had been fumigated and the hall way smelled of marijuana. It was disgusting. ", "I liked that it was central to a lot of places we were out to see and explore.  Hotel was clean, service was great.  Needs some updating on the heaters in the rooms constantly making wierd sounds when it runs.  ", "Everything was clean, convenient, comfortable. Staff were excellent and attentive to all the details. ", "They say it’s only 25 when booking for the resort fee and it ended up being 150 dollars that I could not receive back until after checking out so it sucked as well when trying to shower the water was coming out brown … we  called the front desk And no one picked up as well told them during check out and the staff acted like it was normal ", "This was the WORST hotel experience ever. We stayed 3 nights and booked 2 rms, a Junior Suite 2 bd and a Superior room 2 bd. On both Expedia and Empire websites Junior Suite was classified with \"city view\" and Standard/Superior rooms had \"courtyard view\". I checked in, they gave me Junior Suite room #1012. Upon entering it had an overwhelming smell of mold and sewage and the 2 windows looked out to a BRICK WALL. I went back downstairs and Simone said there were no more Junior Suites and the only other room left in the entire hotel was a Standard 1 queen, which I took because I couldn't bear the smell of mold/sewage in #1012. The next morning I went to the front desk and the manager, Sarah, said she didn't have anymore Junior Suites with City View and could only refund me $50 per night, $150 total for 3 nights. This is simple math. I PREPAID $1,128 for the Junior Suite and $583 for the Superior room. If all you have is a downgraded Standard room, then you should refund me the $545 difference. I asked if I could have a late check out for both rooms at 7pm (instead of refunding $545) but she said no, that would be a 2 full nights room charge. I told her that I would dispute with my credit card, then Sarah asked for my cell# and email but no one contacted me or left a message at the front desk. Next morning, I went down to check out at noon and someone approved our late c/o at 7pm but for only 1 room. I still disputed with credit card co. STAY AWAY from this place if you can!\n\n\n\n", "Nice clean and comfortable,easy access to dining entertainment and shopping ", "Excellent service and location!", "Worst customer service on earth", "Service was terrible rooms wasn’t clean n my booking I asked for a room with a view got the view of a wall .manager was very nasty.myself and my girlfriend will never go back to this hotel terrible experience.", "We had a great one night stay at the Empire.  The hotel has gone renovations and it is in a fabulous location!  Staff was super friendly.  We had a great stay -- would go back!", "Lobby was nice but room was outdated, damaged and dirty. Cable was not connected at all and WiFi was so crappy that not only did I miss my virtual meetings due to inability to connect, but no alternate entertainment with cable out. An absolute waste of money. Never staying there ever again ", "The ppl was friendly ", "Perfection location.  Gorgeous lobby and rooftop bar.  Small rooms - but it's NYC, so not unusual.  Will never stay anywhere else - and I am in the city often. ", "Love the room and service. It would of been nice to have a window view of the street for a single queen room. ", "Great location. Across the street from the Lincoln Center. Restaurant next door and Starbucks two doors away. Subway station across the street. Rooms were very clean. I would stay at the Empire again. Felt very safe as a solo woman traveler.", "Great location near central park. Roof top bar was good but be prepare for the New York premium price. Overall experience was good at this hotel. Across from the location there is a parking lot that charges $50 a night in case you are wondering if parking is nearby. ", "Another family member made the reservation for us, based on location. We found the bedroom furniture attractive, and the bedding clean and comfortable, But, compared to other NY accommodations, our room & bathroom were uncomfortably small with a dearth of outlets for charging our electronics, no place in the bathroom for our toiletries, no instructions for using the TV, no coffeemaker in the room or anyplace to get a cup until the Starbucks on the corner opened at 7 AM. And, the bedside lamps did not give enough light.", "Heating not working properly, very cold, wind through the windows not well isolated, noisy...besides reception, rooms are from a different century in a bad way. will never book again this hotel.\n\n", "We love the location of the Empire and have stayed there a number of time BUT the room we stayed in this time smelled moldy.  We kept the window cracked to let in fresh.   We were also disappointed that valet parking was no longer available, we were told it was due to union issues with the parking garage, not the hotels fault, but annoying. Especially since the parking garage wasn't able to find our vehicle and it took some time to find it. We absolutely love the location and the Empire Rooftop Bar, which we went to on this trip, so we will stay there again, but will definitely say something if there is a problem with the room.  ", "Desperately needs an update. The only plus is its proximity to the Metropolitan Opéra. ", "WiFi never actually works here. Customer productivity and comfort are clearly not the top priority.", "Convenient Manhattan local. Professional staff. Updated large lobby and mezzanine.  Large bedroom for Manhattan.", "Expecting a nice stay at what seemed like a suitable hotel soon turned into a disaster. The employees were unaccommodating and things in the room did not work, like the fridge. A pool is listed in the amenities but they fail to mention it is outdoor and not open this time of year. Customer service was atrocious. Altogether this stay was extremely disappointing. ", "They can't find my reservation and the $150 deposit don't understand if i pay for a night what happens if i don't have no morer money ", "No food, dark hallways, very small bathrooms ", "The hotel was very beautiful. Staff was friendly and nice ", "Mostly how friendly and helpful every single staff member was. ", "My room was supposed to include free parking. I parked in the lot directed to by doorman- no valet. Despite parking ticket ‘stamped’ by hotel I was charged $90.00 after explaining deal with parking lot attendant for over 30 minutes I paid it to get my car. Went back to empire front desk for refund and they wouldn’t acknowledge it. Won’t be stay there again. ", "Nice staff. Great location."]